XYZUtils.vecsAreParallelExact(XYZUtils.XYZ!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,XYZUtils.XYZ!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Determines whether vectors are parallel within DOUBLE_EPS
Returns: if parallel => 1
if not or if either is {0,0,0}. => 0
if antiparallel => -1

XYZUtils.vecsAreParallelApprox(XYZUtils.XYZ!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,XYZUtils.XYZ!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Determines whether vectors are parallel within ANGLE_EPS
Returns: if parallel => 1
if not or if either is {0,0,0}. => 0
if antiparallel => -1

XYZUtils.almostEqual(XYZUtils.XYZ!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,XYZUtils.XYZ!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Returns true when the two vectors are almost equal.
NOTE that the applied tolerance scales with the length of the
vectors.
USE WITH CAUTION
In 3D modeling, a tolerance such as Revit's vertex tolerance
(TessEpsCntrl::getVertexEps) should be used.
Use this only in special cases."

XYZUtils.tripleProduct(XYZUtils.XYZ!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,XYZUtils.XYZ!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,XYZUtils.XYZ!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
The triple product of of three vectors vec0, vec1, vec2 is defined as
dot(cross(vec0, vec1), vec2).
It is equal to the signed volume of the parallelepiped spanned by the three vectors.
It is zero if and only if the vectors are linearly dependent. This function is equivalent
to the Vec3d function vecVolume.

XYZUtils.asUnitOrZero(XYZUtils.XYZ!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Convert the input xyz into a unit vector.
IF the input vector cannot be normalized
THEN the function will return a zero vector.

XYZUtils.asUnit(XYZUtils.XYZ!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Convert the input xyz into a unit vector.
IF the vector cannot be normalized
THEN the function will return std::nullopt.

XYZUtils.midpoint(XYZUtils.XYZ!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,XYZUtils.XYZ!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Returns the midpoint between to vectors.

XYZUtils.cross(XYZUtils.XYZ!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,XYZUtils.XYZ!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Treats lhs and rhs as vectors and returns their cross product.

XYZUtils.dot(XYZUtils.XYZ!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,XYZUtils.XYZ!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Returns the dot product of the two input vectors. If the input is a point rather than a vector it is
not mathematically valid, but is implicitly equivalent to the vector from the origin to the point.
That is, dot(pt1, pt2) is dot(p1 - XYZ::zero(), pt2 - XYZ::zero()).